package com.company.Section5;
        /*
    Напишите соответствующие выражения на языке Java для словесных
описаний, приведенных в таблице (имена для переменных выберите
самостоятельно):
Словесное описание                                                 Выражение на языке Java

Значение переменной больше 90                  / a > 90
Оценка - не меньше 75                          / a >= 75
Разница между значениями отлична от О          / a-b != 0
Значение не превышает 200                      / a <= 200
Значение хотя бы не больше 120                 / a <= 120
Значение одной переменной равно сумме          / a == b+c
значений двух других переменных                / это втроя строка предыдущей строки
         */

import java.util.Scanner;


public class Task52 {
    public static Scanner in = new Scanner(System.in);

    public static void main(String[] args) {




    }
}