package com.company.Section5;
        /*
    В приведенной ниже таблице сделайте для каждого выражения, команды и блока (группы команд)
    словесные описания. Логический тип (булевы значения - «истина» и «ложь»)

Форма записи в языке Java                      |              ответ
__________________________________________________________________________________________________
Equal=(x==t);                                  | переменная Equal равна истина если переменные
                                               | t и x равны между собой иначе ложь
__________________________________________________________________________________________________
proverka=( а==Ь && t==z);                      | переменная proverka равна истина если одновременно
                                               | равны медду собой переменные a,b и t,z иначе ложь
__________________________________________________________________________________________________
prover=true;
System.out. println( "Результат=· +prover);    | выведет на экран значение истина
prover=!prover;                                | присвоение переменной противоположного значения от исходного
System.out. println("Peзyльтaт=" +prover);     | теперь на экране будет значение ложь
prover= !prover;                               | обратное переопределение значения
System.out. println("Peзyльтaт= • +prover);    | Теперь на экране будет истина
___________________________________________________________________________________________________
check=num 1 >num2;                             | если переменная num1 больше переменной num2 тогда
                                               | значение будет истина иначе ложь
___________________________________________________________________________________________________
result=((a+b)> 100);                           | истина если сумма переменных a и b ,больше 100
                                               | иначе ложь
___________________________________________________________________________________________________
оk=((а+b1О-100)!=0)                            | если значение выражения (а+b1О-100)  не равно
                                               | 0 тогда истина иначе ложь

         */

import java.util.Scanner;


public class Task53 {
    public static Scanner in = new Scanner(System.in);

    public static void main(String[] args) {




    }
}