package com.company.Section11;
/*
Задание 11.39
Напишите класс, который выводит на экран все положительные двузначные числа (выберите самостоятельно -
в возрастающем или убывающем порядке), произведение цифр которых является тоже двузначным числом.
 */
public class Task39 {
    public static void main(String[] args) {
        for (int i=10;i<=99;i++){
            System.out.print(i+" ");
        }
    }
}
