package com.company.Section11;
import java.util.Scanner;
/*
Задание 11.49
Напишите класс, который:
• сначала вводит с клавиатуры целое положительное двузначное
число;
• затем выводит на экран (в строку с пробелами) четырехзначные
целые положительные числа, в которых предварительно введенное двузначное число
является «внутренней» частью (как, например, 23 для 1523, или 6237, или 4230)
 */
public class Task49 {
    public static Scanner in = new Scanner(System.in);

    public static void main(String[] args) {

        }
    }


