package com.company.Section10;
import java.lang.Math;
/*
Задание 10.1
Напишите класс, который генерирует и выводит на экран случайное
целое чисел из диапазона положительных двузначных чисел.
 */
public class Task1 {

    public static void main(String[] args) {
        double a = Math.random()*100;
        System.out.println(a);

    }
}
