package com.company.Section6;
        /*

}
int age;
System.out.print("Bвeди свой возраст");
age = input.nextlnt();
if (age>=18) System.out.println ("Можешь участвовать в выборах");
1. Что будет выведено на экран, если с клавиатуры введено значение 8?  ни чего
2. Что будет выведено на экран, если с клавиатуры введено значение 19? Можешь участвовать в выборах
3. Что будет выведено на экран, если с клавиатуры введено значение 18? Можешь участвовать в выборах
4. Приведите пример значения, которое надо ввести с клавиатуры,
чтобы на экран выводилось сообщение Можешь участвовать в           21
выборах.
5. Приведите пример значения, которое надо ввести с клавиатуры,
чтобы на экран не выводилось сообщение Можешь участвовать в выборах. 17
6. Как надо изменить код класса, чтобы кроме сообщения Можешь
участвовать в выборах выводилось на экран - в нужных случаях!
- сообщение Не можешь участвовать в выборах?                         добавить строки
                                                                     else
                                                                     System.out.println ("Не можешь участвовать в выборах");
   */

import java.util.Scanner;


public class Task3 {
    public static Scanner in = new Scanner(System.in);

    public static void main(String[] args) {




    }
}